Revit 2026 API

# DocumentValidation Class

---

Utility functions with document validation

SystemObject Autodesk.Revit.DBDocumentValidation

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DocumentValidation
```
```vb
Public NotInheritable Class DocumentValidation
```
```cpp
public ref class DocumentValidation abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DocumentValidation = class end
```

The DocumentValidation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanDeleteElement | Indicates if an element can be deleted. |

#### Reference

Autodesk.Revit.DB Namespace